<?php
return [
    'EXT000018RQC',	// 心交社
    'EXT00000JO9Z',	// ＰＩＸＹ
    'EXT000002Z2L',	// オールイン　エンタテインメント
    'EXT0000004WV',	// オルスタックピクチャーズ
    'EXT000002MAT',	// キングダム
    'EXT000003SKX',	// スパークビジョン
    'EXT0000074ER',	// ターンテーブル
    'EXT000010AJ3',	// ＢＮＳ
    'EXT000005LFI',	// ローランズ・フィルム
    'EXT00000073J',	// ジャパンホームビデオ
    'EXT0000014PS',	// 日本メディアサプライ
    'EXT0000004PY',	// グラッソ
    'EXT00000021V',	// ハピネット
    'EXT00001ANT0',	// 【ワニッチ】
    'EXT00000128B',	// アースゲート
    'EXT000077EET',	// 竹書房
    'EXT0000002FX',	// イーネット・フロンティア
    'EXT000009OR4',	// リバプール
    'EXT000009LQB',	// ラインコミュニケーションズ
    'EXT0000160FX',	// サンクチュアリ
    'EXT000001K6G',	// レジェンド・ピクチャーズ
    'EXT00000BLBI',	// スパイスビジュアル
    'EXT00000024A',	// 【ティーアイエス】
];
