<?php
return [
    //---------------------
    // レンタルDVD
    //---------------------
    // TSUTAYA一押し
    1 => [
        'recommendation'
    ],
    // 洋画
    2 => [
        'EXT0000001DO',
        'EXT00000018Q',
        'EXT00000022S',
        'EXT0000002GF'
    ],
    // 邦画
    3 => [
        'EXT0000000U9',
        'EXT00000014Q',
        'EXT00000016A',
        'EXT0000001DL'
    ],
    // アニメ・キッズ
    4 => [
        'EXT0000001CL',
        'EXT0000000WP',
        'EXT0000000ZQ',
    ],
    // アジアTVドラマ
    5 => [
        'EXT0000001N4',
    ],
    // 海外TVドラマ
    6 => [
        'EXT0000004DW',
    ],
    // バラエティ
    7 => [
        'EXT0000003GW',
        'EXT000000EVS',
        'EXT0000002G9',
        'EXT0000001NP',
        'EXT0000001WZ',
        'EXT0000002GE',
        'EXT0000003L8',
        'EXT0000003TL',
        'EXT000000DAT',
        'EXT000000ECY',
    ],
    //---------------------
    // 販売DVD
    //---------------------
    // TSUTAYA一押し
    9 => [
        'recommendation'
    ],
    // 音楽
    10 => [
        'EXT0000003GW'
    ],
    // 邦画
    11 => [
        'EXT0000000U9',
        'EXT00000014Q',
        'EXT00000016A',
        'EXT0000001DL',
    ],
    // 洋画
    12 => [
        'EXT0000001DO',
        'EXT00000018Q',
        'EXT00000022S',
        'EXT0000002GF',
    ],
    // アニメ・キッズ
    13 => [
        'EXT0000001CL',
        'EXT0000000WP',
        'EXT0000000ZQ',
    ],
    // 海外TVドラマ
    14 => [
        'EXT0000004DW'
    ],
    // アジアTVドラマ
    15 => [
        'EXT0000001N4'
    ],
    // お笑い
    16 => [
        'EXT000000EVS'
    ],
    //---------------------
    // レンタルCD
    //---------------------
    // 一押し
    17 => [
        'recommendation'
    ],
    // 邦楽
    18 => [
        'EXT0000000DY'
    ],
    // 洋楽
    19 => [
        'EXT00000009V',
        'EXT00000000R',
        'EXT000000011',
        'EXT00000000M',
        'EXT000000028',
        'EXT00000002R',
        'EXT000000009',
        'EXT00000001F',
    ],
    // アニメ
    20 => [
        'EXT0000000KL',
        'EXT00000002X',
        'EXT00000002I',
    ],
    // その他
    21 => [
        'EXT0000000H5',
        'EXT0000000OM',
        'EXT00000001T',
        'EXT0000000C4',
        'EXT0000000Q8',
        'EXT000000016',
        'EXT00000007N',
        'EXT000000022',
        'EXT0000000AW',
        'EXT00002OF8M',
        'EXT00001CDJJ',
        'EXT00000004Q',
    ],
    //---------------------
    // 販売CD
    //---------------------
    // 一押し
    22 => [
        'recommendation'
    ],
    // 邦楽
    23 => [
        'EXT0000000DY'
    ],
    // 洋楽
    24 => [
        'EXT00000009V',
        'EXT00000000R',
        'EXT000000011',
        'EXT00000000M',
        'EXT000000028',
        'EXT00000002R',
        'EXT000000009',
        'EXT00000001F',
    ],
    // アニメ
    25 => [
        'EXT0000000KL',
        'EXT00000002X',
        'EXT00000002I',
    ],
    // 演歌
    26 => [
        'EXT0000000H5'
    ],
    // その他
    27 => [
        'EXT0000000OM',
        'EXT00000001T',
        'EXT0000000C4',
        'EXT0000000Q8',
        'EXT000000016',
        'EXT00000007N',
        'EXT000000022',
        'EXT0000000AW',
        'EXT00002OF8M',
        'EXT00001CDJJ',
        'EXT00000004Q',
    ],
    //---------------------
    // レンタルコミック
    //---------------------
    // 一押し
    28 => [
        'recommendation'
    ],
    // 少女コミック
    29 => [
        'EXT000073XEV'
    ],
    // 少年コミック
    30 => [
        'EXT000073XFI'
    ],
    // 青年コミック
    31 => [
        'EXT000073XFN'
    ],
    // レディースコミック
    32 => [
        'EXT000073XF1'
    ],
    // ボーイズラブコミック
    33 => [
        'EXT000073XF5'
    ],
    // キッズコミック
    34 => [
        'EXT000073XEJ'
    ],
    // サブカルコミック
    35 => [
        'EXT000073XFX'
    ],
    // コミックエッセイ
    36 => [
        'EXT000073XG3'
    ],
    // 四コマコミック
    37 => [
        'EXT000073XGL'
    ],
    // コミック文庫
    38 => [
        'EXT000073XH9'
    ],
    //---------------------
    // 販売コミック
    //---------------------
    // 一押し
    39 => [
        'recommendation'
    ],
    // 少年コミック
    40 => [
        'EXT000073XFI'
    ],
    // 青年コミック
    41 => [
        'EXT000073XFN'
    ],
    // 少女コミック
    42 => [
        'EXT000073XEV'
    ],
    // レディースコミック
    43 => [
        'EXT000073XF1'
    ],
    // ボーイズラブコミック
    44 => [
        'EXT000073XF5'
    ],
    // その他ジャンル
    45 => [
        'EXT000073XEJ',
        'EXT000073XFB',
        'EXT000073XFX',
        'EXT000073XG3',
        'EXT000073XGA',
        'EXT000073XGF',
        'EXT000073XGL',
        'EXT000073XGS',
        'EXT000073XGX',
        'EXT000073XH1',
        'EXT000073XH6',
        'EXT000073XH9',
        'EXT000073XHE',
        'EXT000073XHI',
        'EXT000073XHM',
    ],
    //---------------------
    // 販売本
    //---------------------
    // 文庫
    46 => [
        'EXT000073X16'
    ],
    // 文芸書
    47 => [
        'EXT000073X1R'
    ],
    // タレント写真集
    48 => [
        'EXT000073X1T'
    ],
    // ビジネス
    49 => [
        'EXT000073X2G'
    ],
    // 新書
    50 => [
        'EXT000073X18'
    ],
    //---------------------
    // ゲーム
    //---------------------
    // 一押し
    51 => [
        'recommendation'
    ],
    // プレーステーション4
    52 => [
        'EXT0000S0W29'
    ],
    // Nintendo Switch
    53 => [
        'EXT000077CIL'
    ],
    // ニンテンドー3DS
    54 => [
        'EXT000077CI8'
    ],
    // PS Vita
    55 => [
        'EXT000073X18'
    ],
    //---------------------
    // アダルト
    //---------------------
    // フレッシュギャルズ
    56 => [
        'EXT0000000YC:EXT0000000ZX'
    ],
    // バラティー
    57 => [
        'EXT0000000YC:EXT0000000YD'
    ],
    // 人妻
    58 => [
        'EXT0000000YC:EXT00000013Q'
    ],
    // ドキュメント
    59 => [
        'EXT0000000YC:EXT0000000Z4'
    ],
    // 熟女
    60 => [
        'EXT0000000YC:EXT0000001D1'
    ],
    // 素人
    61 => [
        'EXT0000000YC:EXT00000014W'
    ],
    // ナンパ
    62 => [
        'EXT0000000YC:EXT0000001X1'
    ],
    // レイプ
    63 => [
        'EXT0000000YC:EXT0000001ZA'
    ],
    // マニアック
    64 => [
        'EXT0000000YC:EXT00000024G'
    ],
    // 学園
    65 => [
        'EXT0000000YC:EXT0000001HX'
    ],
    // 女子大生
    66 => [
        'EXT0000000YC:EXT0000001JK'
    ],
    // OL
    67 => [
        'EXT0000000YC:EXT0000001MM'
    ],
    // 働くお姉さん
    68 => [
        'EXT0000000YC:EXT0000001QG'
    ],
    // 看護婦
    69 => [
        'EXT0000000YC:EXT0000001OZ'
    ],
    // 性風俗
    70 => [
        'EXT0000000YC:EXT0000002NG'
    ],
    // オムニバス
    71 => [
        'EXT0000000YC:EXT00000011I'
    ],
    // SM
    72 => [
        'EXT0000000YC:EXT00000023Z'
    ],
    // オナニー
    73 => [
        'EXT0000000YC:EXT0000001X4'
    ],
    // レズビアン
    74 => [
        'EXT0000000YC:EXT00000025P'
    ],
    // 制服 フェチ
    75 => [
        'EXT0000000YC:EXT0000001KZ'
    ],
    // 投稿
    76 => [
        'EXT0000000YC:EXT0000002D4'
    ],
    // 盗撮
    77 => [
        'EXT0000000YC:EXT0000001ZU',
    ],
    // その他
    78 => [
        'EXT0000000YC:EXT0000002PC',
        'EXT0000000YC:EXT0000001E7',
        'EXT0000000YC:EXT0000001G6',
        'EXT0000000YC:EXT0000001W8',
    ],
    // アダルト映画
    79 => [
        'EXT0000007QI'
    ],
    // アダルトアニメ
    80 => [
        'EXT000000Q1W'
    ],
    // アダルトアニメ
    81 => [
        'EXT000073XFR'
    ],

];
